; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v1 - type_1 ?v5 - type_3)
 	      (pred_4 ?v8 - object ?v5 - type_3)
	      (pred_3 ?v1 - type_1 ?v2 - type_2)
	      (pred_1 ?v1 - type_1 ?v8 - object ?v2 - type_2))

   (:action op_1
       :parameters  (?v1 - type_1 ?v7 ?v6 - type_3)
       :precondition (and  (pred_2 ?v1 ?v7))
       :effect (and  (pred_2 ?v1 ?v6)
		     (not (pred_2 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_1 ?v3 - object ?v4 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v4) (pred_2 ?v1 ?v4) (pred_3 ?v1 ?v2))
       :effect (and (pred_1 ?v1 ?v3 ?v2)
		    (not (pred_4 ?v3 ?v4)) 
		    (not (pred_3 ?v1 ?v2))))

   (:action op_3
       :parameters (?v1 - type_1 ?v3 - object ?v4 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v3 ?v2) (pred_2 ?v1 ?v4))
       :effect (and (pred_4 ?v3 ?v4)
		    (pred_3 ?v1 ?v2)
		    (not (pred_1 ?v1 ?v3 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_08 - type_1
obj_12 obj_05 obj_04 obj_01 - type_2
obj_09 obj_06 obj_07 - type_3
obj_11 obj_02 obj_03 - object)
(:init
(pred_2 obj_10 obj_06)
(pred_3 obj_10 obj_12)
(pred_3 obj_10 obj_05)
(pred_2 obj_08 obj_07)
(pred_3 obj_08 obj_04)
(pred_3 obj_08 obj_01)
(pred_4 obj_11 obj_06)
(pred_4 obj_02 obj_09)
(pred_4 obj_03 obj_06)
)
(:goal
(and
(pred_4 obj_11 obj_09)
(pred_4 obj_02 obj_07)
(pred_4 obj_03 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_10 obj_09) (pred_2 obj_08 obj_09))))
  )
)
)

; plan
1. (op_2 obj_10 obj_11 obj_06 obj_05)
   deleted: (pred_4 obj_11 obj_06) (pred_3 obj_10 obj_05)
   added: (pred_1 obj_10 obj_11 obj_05)
   goals met: 0 of 3
2. (op_2 obj_10 obj_03 obj_06 obj_12)
   deleted: (pred_4 obj_03 obj_06) (pred_3 obj_10 obj_12)
   added: (pred_1 obj_10 obj_03 obj_12)
   goals met: 0 of 3
3. (op_1 obj_10 obj_06 obj_09)
   deleted: (pred_2 obj_10 obj_06)
   added: (pred_2 obj_10 obj_09)
   goals met: 0 of 3
4. (op_3 obj_10 obj_11 obj_09 obj_05)
   deleted: (pred_1 obj_10 obj_11 obj_05)
   added: (pred_4 obj_11 obj_09) (pred_3 obj_10 obj_05)
   goals met: 1 of 3
5. (op_3 obj_10 obj_03 obj_09 obj_12)
   deleted: (pred_1 obj_10 obj_03 obj_12)
   added: (pred_4 obj_03 obj_09) (pred_3 obj_10 obj_12)
   goals met: 2 of 3
6. (op_2 obj_10 obj_02 obj_09 obj_05)
   deleted: (pred_4 obj_02 obj_09) (pred_3 obj_10 obj_05)
   added: (pred_1 obj_10 obj_02 obj_05)
   goals met: 2 of 3
7. (op_1 obj_10 obj_09 obj_07)
   deleted: (pred_2 obj_10 obj_09)
   added: (pred_2 obj_10 obj_07)
   goals met: 2 of 3
8. (op_3 obj_10 obj_02 obj_07 obj_05)
   deleted: (pred_1 obj_10 obj_02 obj_05)
   added: (pred_4 obj_02 obj_07) (pred_3 obj_10 obj_05)
   goals met: 3 of 3
